#include <iostream> // Подключаем библиотеку для ввода/вывода.

int main() // Объявляем главную функцию.
{
	double a; // Создаём переменную для хранения значения числа a.
	double b; // Создаём переменную для хранения значения числа b.
	// Используем double, так как числа могут быть дробными.

	std::cout << "Enter the first number: "; // Запрашиваем значение числа a.
	std::cin >> a; // Считываем введённое значение в переменную a.

	std::cout << "Enter the second number: "; // Запрашиваем значение числа b.
	std::cin >> b; // Считываем введённое значение в переменную b.

	// Сравнение двух чисел и вывод результата.
	if (a > b) {
		// Если число a больше числа b, выводим a.
		std::cout << "A larger number: " << a << std::endl;
	} 
	else if (b > a) {
		// Если число b больше числа a, выводим b.
		std::cout << "A larger number: " << b << std::endl;
	} 
	else {
		// Если оба условия не выполнились, то числа равны.
		std::cout << "The numbers are equal" << std::endl;
	}

	return 0; // Успешное завершение программы.
}